In [25]:
# importing necessary libaries 
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [35]:
#connection function 
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name, 
            passwd = user_password
        )
        print("MySQL Database connection sucessful")
    
    except Error as err:
        print(f"Error: '{err}'")
    
    return connection

#Password is 
psd = '*******'
# Connection to the sql 
connection = create_server_connection('localhost', '****', psd)

MySQL Database connection sucessful

In [36]:
# In this function, we are only connecting to the MySQL server, not to any specific database yet.
# First, we create the function and set the connection as "None" (empty) for now.
# Then, inside the try block, we give the login details (host, user, and password) to connect to the server.
# If the connection works, it prints a success message. If not, it shows the error.
# The return line gives us back the connection so we can use it later in other parts of the code.

In [38]:
# Creating a Database in my.sql

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created Sucessfully")
    except Error as Err:
        print(f"Error: '{Err}'")

# This function is used to create a database.
# It takes two inputs: one is the database connection, and the other is the SQL query.
# A cursor is a tool that allows us to run commands on the database, so we create it using the connection.
# Inside the try block, we run the query. If it works, it prints a success message.
# If something goes wrong, the except block will show the error message.
# In the 'create_database_query', we write the SQL command to create the database.
# Then, we call the function and pass in the connection and the query.

In [39]:
create_database_query = "CREATE DATABASE mysql_python_1"
create_database(connection, create_database_query)

Database created Sucessfully

In [40]:
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            password=user_password,
            database=db_name
        )
        print('MySQL Database connection successful')
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [41]:
# Executing queries 

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error: '{err}'")

# This function is used to execute SQL queries on the database.

# The code first creates a cursor, which is used to run commands in the database.
# Inside the try block, it runs the SQL query.
# The commit line saves any changes (like insert, update, or delete) to the database.
# If something goes wrong, the except block will show the error message.

In [42]:
# Creating a table
create_orders_table = """
CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_name VARCHAR(30) NOT NULL,
    product_name VARCHAR(20) NOT NULL,
    date_ordered DATE,
    quantity INT,
    unit_price FLOAT,
    phone_number VARCHAR(20)
);
"""

connection = create_db_connection('localhost', '****', '*******', 'mysql_python_1')
execute_query (connection, create_orders_table)

MySQL Database connection successful
Query was successful

In [43]:
insert_orders = """
INSERT INTO orders (order_id, customer_name, product_name, date_ordered, quantity, unit_price, phone_number)
VALUES 
(101, 'Ali', 'Laptop', '2023-01-10', 1, 750.00, '03001234567'),
(102, 'Sara', 'Phone', '2023-01-15', 2, 450.00, '03012345678'),
(103, 'Ahmed', 'Tablet', '2023-02-01', 1, 300.00, '03023456789'),
(104, 'Ayesha', 'Monitor', '2023-02-10', 3, 150.00, '03034567890'),
(105, 'Usman', 'Keyboard', '2023-03-01', 5, 25.00, '03045678901'),
(106, 'Zainab', 'Mouse', '2023-03-10', 4, 20.00, '03056789012'),
(107, 'Bilal', 'Printer', '2023-04-05', 1, 120.00, '03067890123'),
(108, 'Fatima', 'Speaker', '2023-04-20', 2, 60.00, '03078901234'),
(109, 'Hassan', 'Camera', '2023-05-02', 1, 500.00, '03089012345'),
(110, 'Noor', 'Smartwatch', '2023-05-15', 2, 200.00, '03090123456');
"""
connection = create_db_connection('localhost', '****', '*******', 'mysql_python_1')
execute_query (connection, insert_orders)

MySQL Database connection successful
Query was successful

In [47]:
# Read query and display result 
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error : '{err}'")
# This function reads and prints the result of a query.
# result = None sets the initial value.
# In the try block, it fetches all the results from the query.
# Then it returns the result.

In [52]:
# using select statement 
Q1 = """
select * from orders;
"""
connection = create_db_connection('localhost', '****', '*******', 'mysql_python_1')
result = read_query(connection, Q1)
for results in result:
    print(results)

MySQL Database connection successful
(101, 'Ali', 'Laptop', datetime.date(2023, 1, 10), 1, 750.0, '03001234567')
(102, 'Sara', 'Phone', datetime.date(2023, 1, 15), 2, 450.0, '03012345678')
(103, 'Ahmed', 'Tablet', datetime.date(2023, 2, 1), 1, 300.0, '03023456789')
(104, 'Ayesha', 'Monitor', datetime.date(2023, 2, 10), 3, 150.0, '03034567890')
(105, 'Usman', 'Keyboard', datetime.date(2023, 3, 1), 5, 25.0, '03045678901')
(106, 'Zainab', 'Mouse', datetime.date(2023, 3, 10), 4, 20.0, '03056789012')
(107, 'Bilal', 'Printer', datetime.date(2023, 4, 5), 1, 120.0, '03067890123')
(108, 'Fatima', 'Speaker', datetime.date(2023, 4, 20), 2, 60.0, '03078901234')
(109, 'Hassan', 'Camera', datetime.date(2023, 5, 2), 1, 500.0, '03089012345')
(110, 'Noor', 'Smartwatch', datetime.date(2023, 5, 15), 2, 200.0, '03090123456')

In [ ]:
# The format of the loop is: for each item in a list, do something with that item.
# Here, 'result' is a variable that holds one item at a time from the list called 'results'.
# Then it prints that individual result.

In [54]:
# For one some columns to returns. 

Q2 = """
select order_id, customer_name from orders;
"""
connection = create_db_connection('localhost', '****', '*******', 'mysql_python_1')
result = read_query(connection, Q2)
for results in result:
    print(results)

MySQL Database connection successful
(101, 'Ali')
(102, 'Sara')
(103, 'Ahmed')
(104, 'Ayesha')
(105, 'Usman')
(106, 'Zainab')
(107, 'Bilal')
(108, 'Fatima')
(109, 'Hassan')
(110, 'Noor')

In [55]:
# Print only years from table

Q3 = """
select year(date_ordered) from orders;
"""
connection = create_db_connection('localhost', '****', '*******', 'mysql_python_1')
result = read_query(connection, Q3)
for results in result:
    print(results)

MySQL Database connection successful
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)

In [56]:
#Distinct years
Q4 = """
select distinct(year(date_ordered)) from orders;
"""
connection = create_db_connection('localhost', '****', '*******', 'mysql_python_1')
result = read_query(connection, Q4)
for results in result:
    print(results)

MySQL Database connection successful
(2023,)

In [58]:
# Order by unit price. 
Q5 = """
select * from orders order by unit_price desc ;
"""
connection = create_db_connection('localhost', '****', '*******', 'mysql_python_1')
result = read_query(connection, Q5)
for results in result:
        print(results)

MySQL Database connection successful
(101, 'Ali', 'Laptop', datetime.date(2023, 1, 10), 1, 750.0, '03001234567')
(109, 'Hassan', 'Camera', datetime.date(2023, 5, 2), 1, 500.0, '03089012345')
(102, 'Sara', 'Phone', datetime.date(2023, 1, 15), 2, 450.0, '03012345678')
(103, 'Ahmed', 'Tablet', datetime.date(2023, 2, 1), 1, 300.0, '03023456789')
(110, 'Noor', 'Smartwatch', datetime.date(2023, 5, 15), 2, 200.0, '03090123456')
(104, 'Ayesha', 'Monitor', datetime.date(2023, 2, 10), 3, 150.0, '03034567890')
(107, 'Bilal', 'Printer', datetime.date(2023, 4, 5), 1, 120.0, '03067890123')
(108, 'Fatima', 'Speaker', datetime.date(2023, 4, 20), 2, 60.0, '03078901234')
(105, 'Usman', 'Keyboard', datetime.date(2023, 3, 1), 5, 25.0, '03045678901')
(106, 'Zainab', 'Mouse', datetime.date(2023, 3, 10), 4, 20.0, '03056789012')

In [61]:
# Presenting as a DataFrame

from_db = []
for row in result:
    from_db.append(list(row))

columns = ['order_id', 'customer_name', 'product_name', 'date_ordered', 'quantity', 'unit_price', 'phone_number']
# Only 7 column names are listed above, but the data has 7 fields

# ✅ OR update columns list to match data structure (10 fields if you're selecting * from a wider table)

df = pd.DataFrame(from_db, columns=columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Ali,Laptop,2023-01-10,1,750.0,03001234567
1,109,Hassan,Camera,2023-05-02,1,500.0,03089012345
2,102,Sara,Phone,2023-01-15,2,450.0,03012345678
3,103,Ahmed,Tablet,2023-02-01,1,300.0,03023456789
4,110,Noor,Smartwatch,2023-05-15,2,200.0,03090123456
5,104,Ayesha,Monitor,2023-02-10,3,150.0,03034567890
6,107,Bilal,Printer,2023-04-05,1,120.0,03067890123
7,108,Fatima,Speaker,2023-04-20,2,60.0,03078901234
8,105,Usman,Keyboard,2023-03-01,5,25.0,03045678901
9,106,Zainab,Mouse,2023-03-10,4,20.0,03056789012